STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/LLD_BLE/LLD_BLE_Proximity/STM32_WPAN/App/app_lld_ble.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
  * File Name          : app_lld_ble.c
  * Description        : PROXIMITY LLD BLE Application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "utilities_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "lld_ble.h"
#include "app_lld_ble.h"
#include "tl.h"
#include "shci.h"
#include "stm_logging.h"
#include "stm32_lpm.h"
#include "stm32_seq.h"
#include "gpio_lld.h"

/* Private includes -----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
typedef enum 
{
  CMD_FROM_M0_STOP0_ON           = 0,
  CMD_FROM_M0_STOP1_ON           = 1,
  CMD_FROM_M0_STOP2_ON           = 2,
  CMD_FROM_M0_STOP_OFF           = 3,
  CMD_FROM_M0_GO_IN_WFI          = 4,
  CMD_FROM_M0_GO_DIRECTLY_IN_WFI = 5,
  CMD_FROM_M0_USE_MSI            = 6,
  CMD_FROM_M0_USE_MSI_PLL        = 7,
  CMD_FROM_M0_USE_HSE            = 8,
  CMD_FROM_M0_USE_HSE_PLL        = 9,
  CMD_FROM_M0_EXT_PA_EN          = 10,
  CMD_FROM_M0_EXT_PA_DIS         = 11,
  CMD_FROM_M0_RADIO_STOP         = 12,
  CMD_FROM_M0_RADIO_END          = 13,
  CMD_FROM_M0_RADIO_RXACK        = 14,  
  CMD_FROM_M0_RADIO_RXOK         = 15, 
  CMD_FROM_M0_RADIO_RXACKEND     = 16,  
  CMD_FROM_M0_RADIO_RXOKEND      = 17,  
} cmdFromM0_t;

enum 
{
  CHAR_CTRLC = 3,
  CHAR_ESC   = 27,
  CHAR_DEL   = 127
};

/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define RX_BUFFER_SIZE     258
#define CMD_HISTORY_LENGTH  10
#define CLI_BUFFER_SIZE     30
#define TX_BUFFER_SIZE     268
#define CMD_BUFFER_SIZE      8

/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private function prototypes -----------------------------------------------*/
static void CheckWirelessFirmwareInfo(void);
static void LldBleTraceError(const char * pMess, uint32_t ErrCode);

static void SendM0CmdAckToM0(void);
static void SendCmdToM0(void);
static void SendRspAckToM0(void);

static void uartRxCpltCallback(void);
static void uartRxItProcess(void);
static void uartRxBufferProcessMode(uint8_t uartRxCmdEnable);
static void uartRxBufferProcess(void);
static void uartClearChars(int nbChar);

static void uartTxBufferAdd(const char * str);
static void uartTxItProcess(void);
static void uartTxCpltCallback(void);

static void m0RadioProcess(void);
static void m0CmdProcess(void);
static void m0CmdStopRequired(uint32_t stopRequired);
static void m4ConfigBeforeStop(void);
static void m4ConfigAfterStop(void);

static void Appli_ProcessMode(void);
static void Appli_RegTask(void);
static void Appli_Init(void);
static void Appli_uartRxBufferPrint(void);

void Appli_m0RadioProcess_RadioStop(void);
void Appli_m0RadioProcess_RadioEnd(void);
void Appli_m0RadioProcess_RxAck(void);
void Appli_m0RadioProcess_RxOk(void);
void Appli_m0RadioProcess_RxAckEnd(void);
void Appli_m0RadioProcess_RxOkEnd(void);

void Appli_m0CmdProcess_RadioStop(void);
void Appli_m0CmdProcess_RadioEnd(void);
void Appli_m0CmdProcess_RxAck(void);
void Appli_m0CmdProcess_RxOk(void);
void Appli_m0CmdProcess_RxAckEnd(void);
void Appli_m0CmdProcess_RxOkEnd(void);

/* USER CODE BEGIN PFP */
void BUTTON_SW1_BLE_Init(void);
void BUTTON_SW2_StartPacket(void);
void BUTTON_SW3_StopPacket(void);
void m4CmdPacketStacking (void);
void m4CmdPacketStackProcess (void);
/* USER CODE END PFP */

/* debug function prototypes */
uint32_t Debug_Start_timer(void);
uint32_t Debug_Stop_timer(void);

/* Private variables -----------------------------------------------*/
static cmdFromM0_t m0Cmd = CMD_FROM_M0_STOP_OFF;

static uint8_t  txBusy;
static uint8_t  rxCmdAllowed = 0;
static uint8_t  txBuffer_Tab[TX_BUFFER_SIZE];
static uint32_t txBuffer_wrPtr;
static uint32_t txBuffer_rdPtr;
static uint8_t *pTxBuff_currentWr;
static uint8_t  rxBuffer_Tab[RX_BUFFER_SIZE];
static uint32_t rxBuffer_wrPtr;
static uint32_t rxBuffer_rdPtr;
static uint8_t  currentCommand[CMD_BUFFER_SIZE];
static uint32_t currentCommandPos;
static uint8_t  commandHistory[CMD_HISTORY_LENGTH][RX_BUFFER_SIZE];
static int      commandHistoryIdx;
static int      commandHistoryIdxSav;
static uint32_t txtCommandPos;
static uint8_t  txtCommand[TX_BUFFER_SIZE];
static char     cliPrompt[CLI_BUFFER_SIZE] = "Unknown M0 appli > ";
static uint8_t  uartRxCmd = 0;
static uint32_t delayBeforeSleepOnM4 = 100000;
static uint8_t  uartLastChar;
static uint8_t  uartPayload[RX_BUFFER_SIZE];

/* used with lld_ble */
extern uint8_t  *txBuffer_Ptr;    
uint8_t  *rxBuffer_Ptr[8]; 
uint32_t *rxStatus_Ptr[8]; 
uint32_t *rxTimeStamp_Ptr[8];
int32_t  *rxRSSI_Ptr[8];

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_LLD_BLE_Config_t LldBleConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t LldBleM0CmdPacket;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t LldBleCmdRspPacket;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t  currentCommand[CMD_BUFFER_SIZE];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) param_hal_BLE_t bleparam_hal_BLE_Packet;

/* debug */
#define LLD_BLE_DEBUG
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint32_t debug_timer[4];
uint32_t start_timer;
uint32_t stop_timer;
extern TIM_HandleTypeDef htim2;

/* USER CODE BEGIN PV */
/* Parameters */
uint8_t  init_done =0;
uint8_t  use_hal = 0;

uint32_t proxID = 0x752D5525; // 25 transitions 0xC0

uint8_t  proxChannel = 13;
uint8_t  proxPower = 5;
uint32_t proxWakeup = 1535;
uint32_t proxReceive = 65535;
uint32_t proxReceiveAck = 576;
uint32_t proxtime=1234;

/* data buffer Tab to send TX */
uint8_t proxtxBufferTab[258] ={0x80,0x18, 
0x73,0x65,0x70,0x68,0x26,0x48,0x6F,0x73,0x26,0x48,0x6F,0x73,
0x73,0x65,0x70,0x68,0x26,0x48,0x6F,0x73,0x26,0x48,0x6F,0x73,
};
uint8_t* proxtxBuffer =  proxtxBufferTab;

/* data buffer ACK Tab to send TX ACK after RX */
uint8_t proxAcktxBufferTab[258] ={0x60,0x18, 
0x4a,0x75,0x6c,0x69,0x65,0x6e,0x2b,0x4d,0x61,0x72,0x69,0x6e,
0x4a,0x75,0x6c,0x69,0x65,0x6e,0x2b,0x4d,0x61,0x72,0x69,0x6e,
};
uint8_t* proxAcktxBuffer =  proxAcktxBufferTab;

/* data buffer Tab to receive RX (Not empty)*/
uint8_t proxrxBufferTab[258]={0x77,0x00, 
0xAB,0xBA,0x67,0x76,0x55,0x55,0x4E,0xE4,0x9B,0xB9,0xAB,0xBA,
};
uint8_t* proxrxBuffer =  proxrxBufferTab;

/* data buffer ACK Tab to receive RX ACK after TX */
uint8_t proxAckrxBufferTab[258]={0x33,0x00, 
0x3E,0xE3,0x28,0x82,0x64,0x46,0xC1,0x1C,0x78,0x87,0xDC,0xCD,
};
uint8_t* proxAckrxBuffer= proxAckrxBufferTab;

