STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/LLD_BLE/LLD_BLE_Proximity/STM32_WPAN/App/app_lld_ble.c
      }
    }
    else {
      /* Put the char in UART TX buffer to have the echo sent */
      uartTxBufferAdd(last_char);
      /* Put the char in the current command buffer */
      txtCommand[txtCommandPos++] = last_char[0];
    }
    
    /* Increment read pointer index and manage buffer rollover */
    rxBuffer_rdPtr++;
    if(rxBuffer_rdPtr >= RX_BUFFER_SIZE)
      rxBuffer_rdPtr = 0;
  }
  }
  
  /* Re-activate UART RX buffer processing task */
  UTIL_SEQ_SetTask(1U << CFG_TASK_PROCESS_UART_RX_BUFFER, CFG_SCH_PRIO_0);
}

uint32_t txBufferFullCount;
static void uartTxBufferAdd(const char * str)
{
  uint16_t bytesToWrite = strlen(str);
  uint32_t txBufferFull = 0;
  
  if (bytesToWrite) {
    CRITICAL_BEGIN();
    {
      uint16_t  remainingBytesToWrite = bytesToWrite;
      uint32_t  currentWrPtr  = txBuffer_wrPtr;
      uint8_t * currentWrAddr = &txBuffer_Tab[txBuffer_wrPtr];
      
      while ((remainingBytesToWrite > 0) && (txBufferFull == 0)) {
        if ((txBuffer_rdPtr == (currentWrPtr + 1)) || ((txBuffer_rdPtr == 0) && (currentWrPtr == (TX_BUFFER_SIZE - 1)))) {
          /* If there is not enougth place (i.e. write pointer is just behind read pointer in the circular buffer), 
             buffer is full, so do not consider new string */
          /* !! No trace here as it is under CRITICAL section */
          txBufferFull = 1;
        } else {
          *currentWrAddr = str[bytesToWrite - remainingBytesToWrite];
          remainingBytesToWrite--;
          
          /* Increment write pointer index and manage buffer rollover */
          currentWrPtr++;
          if(currentWrPtr >= TX_BUFFER_SIZE)
            currentWrPtr = 0;
          currentWrAddr = &txBuffer_Tab[currentWrPtr];
        }
      }
      
      if (txBufferFull == 0) {
        txBuffer_wrPtr = currentWrPtr;
      }
    }
    CRITICAL_END();
    
    if (txBufferFull == 0) {
      if (txBusy == 0) {
        txBusy = 1;
        uartTxCpltCallback();
      }
    } else {
      txBufferFullCount++;
      APP_DBG((char *)"!! TX buffer full : %u", txBufferFullCount);
    }
  }
}

static void uartTxCpltCallback(void)
{
  /* Prepare buffer to receive next character */
  if ( txBuffer_rdPtr != txBuffer_wrPtr ) {
    /* Re-put UART device in reception mode (not during IT to avoid locking the device while perhaps in transmit phase) */
    pTxBuff_currentWr = &txBuffer_Tab[txBuffer_rdPtr];
    UTIL_SEQ_SetTask(1U << CFG_TASK_PROCESS_UART_TX_IT, CFG_SCH_PRIO_0);
    
    /* Increment write pointer index and manage buffer rollover */
    txBuffer_rdPtr++;
    if(txBuffer_rdPtr >= TX_BUFFER_SIZE)
      txBuffer_rdPtr = 0;
  } else {
    txBusy = 0;
  }
}

static void uartTxItProcess(void)
{
  /* Put the UART device in transmission mode and wait for interrupts :
       - 1 to write the data in TDR register 
       - 1 when char is sent
       - 1 to indicate end of transmit if several chars are to be transmitted */
  if (HW_UART_Transmit_IT(CFG_CLI_UART, pTxBuff_currentWr, 1, uartTxCpltCallback) != hw_uart_ok)
    APP_DBG((char *)"!! HAL_UART_Transmit_IT error on M4 in uart TX callback !!");
}

/**
 * @brief Process sends CLI command to M0.
 * @param  None
 * @retval None
 */
static void SendCmdToM0(void)
{
  memset(LldBleCmdRspPacket.cmdserial.cmd.payload, 0x0U, 255U);
  *(uint32_t *)LldBleCmdRspPacket.cmdserial.cmd.payload = (uint32_t)currentCommand;
  *(uint32_t *)&LldBleCmdRspPacket.cmdserial.cmd.payload[4] = currentCommandPos;
  LldBleCmdRspPacket.cmdserial.cmd.plen = 8;
  LldBleCmdRspPacket.cmdserial.cmd.cmdcode = 0x0;
  
  TL_LLD_BLE_SendCmd();
}

/**
 * @brief Perform initialization of TL for LLD tests.
 * @param  None
 * @retval None
 */
void APP_LLD_BLE_Init_TL(void)
{
  LldBleConfigBuffer.p_LldBleCmdRspBuffer = (uint8_t*)&LldBleCmdRspPacket;
  LldBleConfigBuffer.p_LldBleM0CmdBuffer = (uint8_t*)&LldBleM0CmdPacket;
  
  TL_LLD_BLE_Init( &LldBleConfigBuffer );
}

static void m0RadioProcess(void)
{
  switch (m0Cmd) {
    case CMD_FROM_M0_RADIO_STOP :
      Appli_m0RadioProcess_RadioStop();
      break;

    case CMD_FROM_M0_RADIO_END :
      Appli_m0RadioProcess_RadioEnd();
      break;
     
    case CMD_FROM_M0_RADIO_RXACK :
      Appli_m0RadioProcess_RxAck();
      break;  

    case CMD_FROM_M0_RADIO_RXOK :
      Appli_m0RadioProcess_RxOk();
      break;
       
   case CMD_FROM_M0_RADIO_RXACKEND :
      Appli_m0RadioProcess_RxAckEnd();
      break;  
               
    case CMD_FROM_M0_RADIO_RXOKEND :
      Appli_m0RadioProcess_RxOkEnd();
      break;
   
    default:
      break;
  }
}

static void m0CmdProcess(void)
{
  switch (m0Cmd) {
    
    case CMD_FROM_M0_RADIO_STOP :
      Appli_m0CmdProcess_RadioStop();
      break;
      
    case CMD_FROM_M0_RADIO_END :
      Appli_m0CmdProcess_RadioEnd();
      break;
      
    case CMD_FROM_M0_RADIO_RXACK :
      Appli_m0CmdProcess_RxAck();
      break;
      
    case CMD_FROM_M0_RADIO_RXOK :
      Appli_m0CmdProcess_RxOk();
      break;
  
    case CMD_FROM_M0_RADIO_RXACKEND :
      Appli_m0CmdProcess_RxAckEnd();
      break;

    case CMD_FROM_M0_RADIO_RXOKEND :
      Appli_m0CmdProcess_RxOkEnd();
      break;
    
    case CMD_FROM_M0_STOP0_ON :
      m0CmdStopRequired(0);
      break;
    
    case CMD_FROM_M0_STOP1_ON :
      m0CmdStopRequired(1);
      break;
    
    case CMD_FROM_M0_STOP2_ON :
      m0CmdStopRequired(2);
      break;
    
    case CMD_FROM_M0_STOP_OFF :
      // Nothing done here as the goal of this command is just to have an IPCC interrupt
      // that will make the M4 going out of STOP or WFI
      break;
    
    case CMD_FROM_M0_GO_IN_WFI :
      m0CmdStopRequired(3);
      break;
    
    case CMD_FROM_M0_GO_DIRECTLY_IN_WFI :
      m0CmdStopRequired(4);
      break;
    
    case CMD_FROM_M0_USE_MSI :
      SystemClock_Config_MSI(0);
      break;
    
    case CMD_FROM_M0_USE_MSI_PLL :
      SystemClock_Config_MSI(1);
      break;
    
    case CMD_FROM_M0_USE_HSE :
      SystemClock_Config_HSE(0);
      break;
    
    case CMD_FROM_M0_USE_HSE_PLL :
      SystemClock_Config_HSE(1);
      break;
    
