STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/LLD_BLE/LLD_BLE_Proximity/STM32_WPAN/App/app_lld_ble.c
#if (CFG_HW_EXTPA_ENABLED == 1)
    case CMD_FROM_M0_EXT_PA_EN :
      gpio_lld_extPa_init();
      // Indicate to M0 which GPIO must be managed
      SHCI_C2_ExtpaConfig((uint32_t)GPIO_EXT_PA_EN_PORT, GPIO_EXT_PA_EN_PIN, EXT_PA_ENABLED_HIGH, EXT_PA_ENABLED);
      break;
    
    case CMD_FROM_M0_EXT_PA_DIS :
      gpio_lld_extPa_deInit();
      SHCI_C2_ExtpaConfig((uint32_t)GPIO_EXT_PA_EN_PORT, GPIO_EXT_PA_EN_PIN, EXT_PA_ENABLED_HIGH, EXT_PA_DISABLED);
      break;
#endif
    
    default:
      break;
  }
}

static void m4ConfigBeforeStop(void)
{
  // Clear C1 Stop flag if any remaining
  LL_PWR_ClearFlag_C1STOP_C1STB();
}

static void m4ConfigAfterStop(void)
{
  // Clear C1 Stop flag
  LL_PWR_ClearFlag_C1STOP_C1STB();
}

static void m0CmdStopRequired(uint32_t stopRequired)
{
  switch (stopRequired) {
    case 0:
      // flush IPC and trace before sleeping. Let time to M0 to set RF in sleep and to be in STOP if needed
      HAL_Delay(delayBeforeSleepOnM4);
      
      // Stop UART and its GPIOs to reduce power consumption
      APP_LLD_BLE_DeInit_UART_CLI();
#if (CFG_HW_LPUART1_ENABLED == 1)
      MX_LPUART1_UART_DeInit();
#endif
      
      // trial for no IT (ex RF) at low speed
      CRITICAL_BEGIN();
      
      // Prepare system to be stopped
      m4ConfigBeforeStop();
      
      // Enter selected STOP mode
      HAL_PWREx_EnterSTOP0Mode(PWR_STOPENTRY_WFI);
      
      // Restart system
      m4ConfigAfterStop();
      
      // Restart UART before to go out of critical area to not have to send trace from M0 before to restart it
      APP_LLD_BLE_Init_UART_CLI();
#if (CFG_HW_LPUART1_ENABLED == 1)
      #if(CFG_DEBUG_TRACE != 0)
      MX_LPUART1_UART_Init();
      #endif
#endif
      
      // trial for no IT (ex RF) at low speed
      CRITICAL_END();
      
      APP_DBG("M4 back from STOP0");
      break;
    
    case 1:
      // flush IPC and trace before sleeping. Let time to M0 to set RF in sleep and to be in STOP if needed
      HAL_Delay(delayBeforeSleepOnM4);
      
      // Stop UART and its GPIOs to reduce power consumption
      APP_LLD_BLE_DeInit_UART_CLI();
#if (CFG_HW_LPUART1_ENABLED == 1)
      MX_LPUART1_UART_DeInit();
#endif
      
      // trial for no IT (ex RF) at low speed
      CRITICAL_BEGIN();
      
      // Prepare system to be stopped
      m4ConfigBeforeStop();
      
      // Enter selected STOP mode
      HAL_PWREx_EnterSTOP1Mode(PWR_STOPENTRY_WFI);
      
      // Restart system
      m4ConfigAfterStop();
      
      // Restart UART before to go out of critical area to not have to send trace from M0 before to restart it
      APP_LLD_BLE_Init_UART_CLI();
#if (CFG_HW_LPUART1_ENABLED == 1)
      #if(CFG_DEBUG_TRACE != 0)
      MX_LPUART1_UART_Init();
      #endif
#endif
      
      // trial for no IT (ex RF) at low speed
      CRITICAL_END();
      
      APP_DBG("M4 back from STOP1");
      break;
    
    case 2:
      // flush IPC and trace before sleeping. Let time to M0 to set RF in sleep and to be in STOP if needed
      HAL_Delay(delayBeforeSleepOnM4);
      
      // Stop UART and its GPIOs to reduce power consumption
      APP_LLD_BLE_DeInit_UART_CLI();
#if (CFG_HW_LPUART1_ENABLED == 1)
      MX_LPUART1_UART_DeInit();
#endif
      
      // trial for no IT (ex RF) at low speed
      CRITICAL_BEGIN();
      
      // Prepare system to be stopped
      m4ConfigBeforeStop();
      
      // Enter selected STOP mode
      HAL_PWREx_EnterSTOP2Mode(PWR_STOPENTRY_WFI);
      
      // Restart system
      m4ConfigAfterStop();
      
      // Restart UART before to go out of critical area to not have to send trace from M0 before to restart it
      APP_LLD_BLE_Init_UART_CLI();
#if (CFG_HW_LPUART1_ENABLED == 1)
      #if(CFG_DEBUG_TRACE != 0)
      MX_LPUART1_UART_Init();
      #endif
#endif
      
      // trial for no IT (ex RF) at low speed
      CRITICAL_END();
      
      APP_DBG("M4 back from STOP2");
      break;
    
    case 3:
      // flush IPC and trace before sleeping. Let time to M0 to set RF in sleep and to be in STOP if needed
      HAL_Delay(delayBeforeSleepOnM4);
      
      // Stop UART and its GPIOs to reduce power consumption
      APP_LLD_BLE_DeInit_UART_CLI();
#if (CFG_HW_LPUART1_ENABLED == 1)
      MX_LPUART1_UART_DeInit();
#endif
      
      // trial for no IT (ex RF) at low speed
      CRITICAL_BEGIN();
      
      __WFI();
      // Restart UART before to go out of critical area to not have to send trace from M0 before to restart it
      APP_LLD_BLE_Init_UART_CLI();
#if (CFG_HW_LPUART1_ENABLED == 1)
      #if(CFG_DEBUG_TRACE != 0)
      MX_LPUART1_UART_Init();
      #endif
#endif
      
      // trial for no IT (ex RF) at low speed
      CRITICAL_END();
      
      APP_DBG("M4 back from WFI");
      break;
    
    case 4:
      // Put M4 in WFI without delay :
      //   - In some cases, it is recomanded to limit the M4 activity to avoid Flash access which can slow down the M0 which share it with M4
      //   - But, be carrefull as WFI can be blocking as there is no more interrupts
      //   - As example, if not used, SF timer test is failed.
      __WFI();
      APP_DBG("M4 back from WFI (without delay)");
      break;
    
    default:
      break;
  }
}

/**
 * @brief Send Ack to M0 CLI Response channel.
 * @param  None
 * @retval None
 */
static void SendRspAckToM0(void)
{
  /* Notify M0 that CLI notification has been taken into account */
  TL_LLD_BLE_SendRspAck();
}

/**
 * @brief  This function is called when notification on CLI TL Channel from M0+ is received.
 *
 * @param   Notbuffer : a pointer to TL_CmdPacket_t
 * @return  None
 */
void TL_LLD_BLE_ReceiveRsp( TL_CmdPacket_t * Notbuffer )
{

  uint8_t         l_size = Notbuffer->cmdserial.cmd.plen;
  char *          sourceBuf = (char *)Notbuffer->cmdserial.cmd.payload;
  
  if (l_size > 0)
  {
    if (strncmp(sourceBuf, "Resp_End", 9) == 0)
    {
      /* This is an answer to indicate that the CLI command has been completed */
      UTIL_SEQ_SetEvt(1U << CFG_EVT_RECEIVE_RSPACKEVT);

      /* Write a promp to UART and allow to receive a new command */
      //sprintf(cliPrompt, "LLD BLE > ");
      //uartTxBufferAdd("\r\n");
      //uartTxBufferAdd(cliPrompt);

      currentCommandPos = 0;
      rxCmdAllowed = 1;
    }
   else
    {
      /* This is just a trace from M0, write to CLI UART buffer */
      uartTxBufferAdd(sourceBuf);
    }
  }
  else
  {
    APP_DBG((char *)"!! Empty M0 CLI response received by M4 !!");
  }
  SendRspAckToM0();
}

/**
 * @brief Send Ack to M0 CLI Response channel.
 * @param  None
 * @retval None
 */
static void SendM0CmdAckToM0(void)
{
  /* Notify M0 that CLI notification has been taken into account */
  TL_LLD_BLE_SendM0CmdAck();
}

/**
 * @brief  This function is called when notification on CLI TL Channel from M0+ is received.
 *
 * @param   Notbuffer : a pointer to TL_CmdPacket_t
 * @return  None
 */
void TL_LLD_BLE_ReceiveM0Cmd( TL_CmdPacket_t * cmdBuffer )
{
  //TL_CmdPacket_t* l_CliBuffer = (TL_CmdPacket_t*)Notbuffer;
  uint8_t bufferSize = cmdBuffer->cmdserial.cmd.plen;
  char *  bufferAddr = (char *)cmdBuffer->cmdserial.cmd.payload;
  //uint32_t        length = *(uint32_t *)&l_CliBuffer->cmdserial.cmd.payload[4];

  if (bufferSize > 0)
  {
    if (strncmp(bufferAddr, "Radio_Stop", 10) == 0)
    {
      m0Cmd = CMD_FROM_M0_RADIO_STOP;
      
      /* Action under IT */
      m0RadioProcess();

      /* Action under Sequencer */
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_FROM_M0_TO_M4, CFG_SCH_PRIO_0);

