STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/LLD_BLE/LLD_BLE_Proximity/STM32_WPAN/App/app_lld_ble.c
void Appli_Init(void)
{
  proxSTDEVICEUDN[0]=LL_FLASH_GetUDN();
  proxSTDEVICEUDN[1]=(LL_FLASH_GetSTCompanyID() << 8)| LL_FLASH_GetDeviceID();
  proxSTDEVICEUDN[2]=HAL_GetDEVID();
  proxSTDEVICEUDN[3]=HAL_GetUIDw0();
  proxSTDEVICEUDN[4]=HAL_GetUIDw1();
  proxSTDEVICEUDN[5]=HAL_GetUIDw2();

  uint8_t i = 0;
  for (i=0; i<(6*4);i++)
  {
    proxtxBufferTab[i+2]=(uint8_t)(proxSTDEVICEUDN[i/4]>>((i%4)*8) & 0xFF);
    proxAcktxBufferTab[i+2]=~proxtxBufferTab[i+2];
  }
}

void Appli_uartRxBufferPrint(void)
{
        sprintf(cliPrompt, "LLD BLE > ");
        uartTxBufferAdd(cliPrompt);
}

/* Appli radio functions */
void Appli_m0RadioProcess_RadioStop(void)
{
      /* copy status from M0 BLE Radio */
      radioPacketNb=bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer[257]; 
      *rxStatus_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.status; // status
}

void Appli_m0RadioProcess_RadioEnd(void)
{
      /* copy status from M0 BLE Radio */
      radioPacketNb=bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer[257]; 
      *rxStatus_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.status; // status
      UTIL_SEQ_PauseTask(1U <<CFG_TASK_CMD_M4_PACKET_STACK_PROCESS);
}

void Appli_m0RadioProcess_RxAck(void)
{
      /* copy status from M0 BLE Radio */
      radioPacketNb=bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer[257]; 
      *rxStatus_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.status; // status
}

void Appli_m0RadioProcess_RxOk(void)
{
      /* copy status from M0 BLE Radio */
      radioPacketNb=bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer[257]; 
      *rxStatus_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.status; // status
      *rxTimeStamp_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.timestamp_receive; // timestamp_receive
      *rxRSSI_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.rssi; // rssi
      /* copy payload from M0 BLE Radio */
      memcpy(rxBuffer_Ptr[radioPacketNb],(bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer),258); 
      UTIL_SEQ_PauseTask(1U <<CFG_TASK_CMD_M4_PACKET_STACK_PROCESS);
}

void Appli_m0RadioProcess_RxAckEnd(void)
{
      /* copy status from M0 BLE Radio */
      radioPacketNb=bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer[257]; 
      *rxStatus_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.status; // status
}

void Appli_m0RadioProcess_RxOkEnd(void)
{
      /* copy status from M0 BLE Radio */
      radioPacketNb=bleparam_hal_BLE_Packet.txrxBuffer.rxBuffer[257]; 
      *rxStatus_Ptr[radioPacketNb]=bleparam_hal_BLE_Packet.status; // status
}


void Appli_m0CmdProcess_RadioStop(void)
{
      HAL_TIM_Base_Stop_IT(&htim2);
      
      uint8_t j;
      extern uint8_t Packet_ID[8][24];
      extern uint8_t Local_ID[24];
      extern uint8_t Recorded_ID;
              
      sprintf(cliPrompt, "\r\nLocal     ID  > ");
      for (j=0 ; j<2; j++) //24
      { 
        sprintf(cliPrompt, "%s %2x ",cliPrompt, Local_ID[j]); // Record ID from Stack_Packet
      }
      
      while(Recorded_ID)
      {
        sprintf(cliPrompt, "%s\r\nRadio Get ID %d> " ,cliPrompt ,Recorded_ID);
        for (j=0 ; j<2; j++) //24
        { 
          sprintf(cliPrompt, "%s %2x ",cliPrompt, Packet_ID[Recorded_ID-1][j]); // Record ID from Stack_Packet
        }
      Recorded_ID--;  
      }
      uartTxBufferAdd(cliPrompt);
}

void Appli_m0CmdProcess_RadioEnd(void)
{
      UTIL_SEQ_SetTask(1U <<CFG_TASK_CMD_M4_PACKET_STACKING , CFG_SCH_PRIO_0);
      if(uartLastChar)  uartLastChar=0;
}

void Appli_m0CmdProcess_RxAck(void)
{
}

void Appli_m0CmdProcess_RxOk(void)
{
      UTIL_SEQ_SetTask(1U <<CFG_TASK_CMD_M4_PACKET_STACKING , CFG_SCH_PRIO_0);
}

void Appli_m0CmdProcess_RxAckEnd(void)
{
}

void Appli_m0CmdProcess_RxOkEnd(void)
{
}

/* Appli custom functions */
void BUTTON_SW1_BLE_Init(void)
{
           #ifdef LLD_BLE_DEBUG
           bleparam_hal_BLE_Packet.InfoTime=(uint32_t)debug_timer;
           #endif
      LLD_BLE_Init(HS_STARTUP_TIME, 1, LLD_BLE_hot_ana_config_table, ENABLE); // lecozj ENABLE for whitening
      UTIL_SEQ_SetTask(1U << CFG_TASK_CMD_M4_PACKET_STACKING, CFG_SCH_PRIO_0);

      BSP_LED_On(LED_BLUE);

}


//    ___________________________
//   |                   _____   | 
//   |       true |---=>|2:TX |__|       
//   |   _____    |  |  |_____|     _____
//   |=>|0:RX |___|  |_____________|1:RX |        
//   |  |_____|___    _____________|_____|<=-|  
//   |            |  |   _____      _____    | 
//   |      false |---=>|3:TX |--=>|4:RX |___|
//   |                  |_____|    |_____|___
//   |_______________________________________|
//
void BUTTON_SW2_StartPacket(void)
{
  LED_TXRX=LED_GREEN;

      LLD_BLE_GetStatus(&proxtime);

      uint8_t map[5]= {0xFF,0xFF,0xFF,0xFF,0xFF};
      LLD_BLE_SetChannelMap(STATE_MACHINE_3, &map[0]);
      LLD_BLE_SetChannel(STATE_MACHINE_3, proxChannel, 0);
      LLD_BLE_SetTxAttributes(STATE_MACHINE_3, proxID, 0x555555,0);   
      LLD_BLE_SetTx_Rx_Phy(STATE_MACHINE_3, TX_PHY_2MBPS, RX_PHY_2MBPS);
      LLD_BLE_SetTxPower(proxPower);
      LLD_BLE_SetBackToBackTime(BACK2BACK_TIME);
      
      //uint8_t map[5]= {0xBB,0xFF,0xFF,0xFF,0xBB};
      LLD_BLE_SetChannelMap(STATE_MACHINE_0, &map[0]);
      LLD_BLE_SetChannel(STATE_MACHINE_0,(proxChannel+2),0);
      LLD_BLE_SetTxAttributes(STATE_MACHINE_0, ~proxID, 0x555555,0);
      LLD_BLE_SetTx_Rx_Phy(STATE_MACHINE_0, TX_PHY_2MBPS, RX_PHY_2MBPS);
      LLD_BLE_SetBackToBackTime(BACK2BACK_TIME);
      
      
      proxPacket[APACKET_0].StateMachineNo = STATE_MACHINE_0;  // First RX 
      proxPacket[APACKET_0].ActionTag =  PLL_TRIG | TIMER_WAKEUP | RELATIVE;   
      proxPacket[APACKET_0].WakeupTime = proxWakeup;
      proxPacket[APACKET_0].ReceiveWindowLength = proxReceive; 
      proxPacket[APACKET_0].data = proxrxBuffer; 
      proxPacket[APACKET_0].next_true = APACKET_2;  // Ack
      proxPacket[APACKET_0].next_false = APACKET_3;    
      proxPacket[APACKET_0].condRoutine = condCase_Rx;
      proxPacket[APACKET_0].dataRoutine = dataRoutine_Action;
      proxPacket[APACKET_0].actionPacketNb = APACKET_0; 
      LLD_BLE_SetReservedArea(&proxPacket[APACKET_0]);
      
      proxPacket[APACKET_1].StateMachineNo = STATE_MACHINE_0;   //  Second RX
      proxPacket[APACKET_1].ActionTag =  PLL_TRIG | TIMER_WAKEUP | RELATIVE;   
      proxPacket[APACKET_1].WakeupTime = 4*proxReceive;
      proxPacket[APACKET_1].ReceiveWindowLength = proxReceive; 
      proxPacket[APACKET_1].data = proxrxBuffer; 
      proxPacket[APACKET_1].next_true = APACKET_2;  // back to RX
      proxPacket[APACKET_1].next_false = APACKET_3;    
      proxPacket[APACKET_1].condRoutine = condCase_Rx;
      proxPacket[APACKET_1].dataRoutine = dataRoutine_Action;
      proxPacket[APACKET_1].actionPacketNb = APACKET_1; 
      LLD_BLE_SetReservedArea(&proxPacket[APACKET_1]);
      
      proxPacket[APACKET_2].StateMachineNo = STATE_MACHINE_3;   // TX Ack State Machine of ACK 
      proxPacket[APACKET_2].ActionTag =  TXRX ;  
      proxPacket[APACKET_2].WakeupTime = proxWakeup;
      proxPacket[APACKET_2].ReceiveWindowLength = 0; /* does not affect for Tx */
      proxPacket[APACKET_2].data = proxAcktxBuffer;
      proxPacket[APACKET_2].next_true = APACKET_0;
      proxPacket[APACKET_2].next_false = APACKET_NULL;   
      proxPacket[APACKET_2].condRoutine = condCase_Done;
      proxPacket[APACKET_2].dataRoutine = dataRoutineDone_hal_BLE; // return TRUE
      proxPacket[APACKET_2].actionPacketNb = APACKET_2; 
      LLD_BLE_SetReservedArea(&proxPacket[APACKET_2]);

      proxPacket[APACKET_3].StateMachineNo = STATE_MACHINE_0;   
      proxPacket[APACKET_3].ActionTag =  TXRX ;   
      proxPacket[APACKET_3].WakeupTime = proxWakeup;
      proxPacket[APACKET_3].ReceiveWindowLength = 0 ; /* does not affect for Tx */
      proxPacket[APACKET_3].data = proxtxBuffer; 
      proxPacket[APACKET_3].next_true = APACKET_4;  // Ack
      proxPacket[APACKET_3].next_false = APACKET_NULL;    
      proxPacket[APACKET_3].condRoutine = condCase_Done;
      proxPacket[APACKET_3].dataRoutine = dataRoutine_Action;
      proxPacket[APACKET_3].actionPacketNb = APACKET_3; 
      LLD_BLE_SetReservedArea(&proxPacket[APACKET_3]);
      
      proxPacket[APACKET_4].StateMachineNo = STATE_MACHINE_3;  // RX Ack State Machine of ACK 
      proxPacket[APACKET_4].ActionTag =  0;   
      proxPacket[APACKET_4].WakeupTime = proxWakeup;
      proxPacket[APACKET_4].ReceiveWindowLength = proxReceiveAck; 
      proxPacket[APACKET_4].data = proxAckrxBuffer; 
      proxPacket[APACKET_4].next_true = APACKET_1; // Ack
      proxPacket[APACKET_4].next_false = APACKET_0;    
      proxPacket[APACKET_4].condRoutine = condCase_Rx;
      proxPacket[APACKET_4].dataRoutine = dataRoutineDone_hal_BLE;
      proxPacket[APACKET_4].actionPacketNb = APACKET_4; 
      LLD_BLE_SetReservedArea(&proxPacket[APACKET_4]);

      APP_LLD_BLE_SetdataRoutineOption(proxPacketNumber,proxPacketStopRx);
        #ifdef LLD_BLE_DEBUG
        start_timer=Debug_Start_timer();
        #endif
      LLD_BLE_MakeActionPacketPending(&proxPacket[APACKET_0]);
        #ifdef LLD_BLE_DEBUG
        stop_timer=Debug_Stop_timer();
        #endif
      BSP_LED_On(LED_TXRX);

