STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/LLD_BLE/LLD_BLE_Proximity/STM32_WPAN/App/app_lld_ble.c
}

void BUTTON_SW3_StopPacket(void)
{
  LED_TXRX=LED_GREEN;
      //LLD_BLE_StopActivity();
      proxPacket[APACKET_1].next_true = APACKET_NULL;
      proxPacket[APACKET_3].next_true = APACKET_NULL;
      LLD_BLE_SetReservedArea(&proxPacket[APACKET_1]);
      LLD_BLE_SetReservedArea(&proxPacket[APACKET_3]);

      BSP_LED_Off(LED_TXRX);
}

void m4CmdPacketStacking(void) // CFG_TASK_CMD_M4_PACKET_STACKING
{
  uint8_t i=0;
  for (i=0 ; i<8 ; i++) // parsed all the actionPacket and keep packet with data not empty
  {
    if ((proxPacket[i].status & BIT_TX_MODE)==0 && (proxPacket[i].status & IRQ_RCV_OK)!=0) 
    {
      if( ((proxPacket[i].rssi)+80) > 0)
      {
        // SEMA start
        memcpy(Packet_Ptr[Stack_Packet++],proxPacket[i].data,26);
        proxPacket[i].status=0;
        // SEMA end
      }
    } else if ((proxPacket[i].status & BIT_TX_MODE)!=0) {
      proxPacket[i].WakeupTime = (proxPacket[i].WakeupTime == proxWakeup)? ((__HAL_TIM_GET_COUNTER(&htim2)%3)*proxReceive+proxReceive): proxWakeup;
      //LLD_BLE_SetReservedArea(&proxPacket[i]);
      proxPacket[i].status=0;
    }
  }
  //UTIL_SEQ_PauseTask(CFG_TASK_CMD_M4_PACKET_STACKING);
  UTIL_SEQ_ResumeTask(1U <<CFG_TASK_CMD_M4_PACKET_STACK_PROCESS);
  UTIL_SEQ_SetTask(1U <<CFG_TASK_CMD_M4_PACKET_STACK_PROCESS , CFG_SCH_PRIO_0);


}

void m4CmdPacketStackProcess(void) // CFG_TASK_CMD_M4_PACKET_STACK_PROCESS
{ 
  uint8_t i=0, j=0;
  if(init_ID++==0) memcpy(Local_ID,(uint8_t*)proxSTDEVICEUDN,24); // init [0] with local ID

  if (Stack_Packet>0)
  {
    if (Recorded_ID<8) /* write max of 8 ID*/
    {
      for (j=0 ; j<24; j++)
      {
        Packet_ID[Recorded_ID][j]=Packet_Ptr[Stack_Packet-1][j+2] ; // Record ID from Stack_Packet
      }
      Stack_Packet--;
      if (Recorded_ID==0)
      {  
        Recorded_ID++; // no compare We keep first 
      } else {
        uint8_t comp_ID = 0 ;
        for (i=0 ; i<Recorded_ID; i++) /* compare */
        {
          comp_ID = 0 ;
          for (j=0 ; j<24; j++)
          {
            if (Packet_ID[i][j]==Packet_ID[Recorded_ID][j])
            { 
              comp_ID++ ;
              continue; // continue to compare
            } else {
              break;  // go to next comparison as it is different
            }
          }
          if (comp_ID==24) break; // We already have this ID as all the 24 bytes are similar
        } 
        if (comp_ID!=24) 
        {
          Recorded_ID++; // We do not removed we keep this ID
        }
      }
    }
    UTIL_SEQ_SetTask(1U <<CFG_TASK_CMD_M4_PACKET_STACK_PROCESS , CFG_SCH_PRIO_0);
  }
}
/* USER CODE END FD */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
void Appli_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  switch (GPIO_Pin)
  {
    case BUTTON_SW1_PIN:
      UTIL_SEQ_SetTask(1U << CFG_TASK_HAL_BLE_INIT, CFG_SCH_PRIO_0);
      break; 

    case BUTTON_SW2_PIN:
      UTIL_SEQ_SetTask(1U << CFG_TASK_HAL_BLE_SENDPACKET, CFG_SCH_PRIO_0);
      break; 

    case BUTTON_SW3_PIN:
      UTIL_SEQ_SetTask(1U << CFG_TASK_HAL_BLE_RECEIVEPACKET, CFG_SCH_PRIO_0);
      break;

    default:
      break;

  }
  return;
}
void Appli_TIM_IC_CaptureCallback(void)
{
}

void Appli_TIM_PeriodElapsedCallback(void)
{
}
/* USER CODE END FD_WRAP_FUNCTIONS */

/* debug */
uint32_t Debug_Start_timer(void)
{
  debug_timer[0]=__HAL_TIM_GET_COUNTER(&htim2);
  if(!debug_timer[2])
  {
  return 0;
  } else
  {
  return(debug_timer[0]-debug_timer[2]);
  }
}
uint32_t Debug_Stop_timer(void)
{
  debug_timer[1]=__HAL_TIM_GET_COUNTER(&htim2);
  return(debug_timer[1]-debug_timer[0]);
}


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
